BFarkascode/STM32_DSI/Disco_u5g9_Custom_DSI/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32u5xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
//#include "stm32u5x9j_discovery.h"
#include "image_320x240_argb8888.h"
#include "life_augmented_argb8888.h"
#include <string.h>
#include <stdio.h>
#include "stdlib.h"

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define VFP 50
#define LCD_WIDTH 480
#define VBP 12
#define LCD_FRAME_BUFFER 0x200D0000
#define HACT 480
#define VSYNC 1
#define HFP 1
#define VACT 481
#define IMAGE_HEIGHT 240
#define HBP 1
#define IMAGE_WIDTH 320
#define LCD_HEIGHT 481
#define HSYNCH 2
#define DSI_RESETn_Pin GPIO_PIN_5
#define DSI_RESETn_GPIO_Port GPIOD

/* USER CODE BEGIN Private defines */

#define VFP 50
#define LCD_WIDTH 480
#define VBP 12
#define LCD_FRAME_BUFFER 0x200D0000
#define HACT 480
#define VSYNC 1
#define HFP 1
#define VACT 481
#define IMAGE_HEIGHT 240
#define HBP 1
#define IMAGE_WIDTH 320
#define LCD_HEIGHT 481
#define HSYNCH 2
#define DSI_RESETn_Pin GPIO_PIN_5
#define DSI_RESETn_GPIO_Port GPIOD

typedef enum {
	Right,
	Left,
	Up,
	Down
} enum_Direction_Selector;

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
